public/man/man1/flatpak-list.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-list.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-list.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-list - List installed applications and/or runtimes</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak list</strong> [OPTION…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Lists the names of the installed applications and runtimes.</p>
<p>
By default, both apps and runtimes are shown, but you can change this by
using the <strong>–app</strong> or <strong>–runtime</strong> options.</p>
<p>
By default, both per-user and system-wide installations are shown. Use
the <strong>–user</strong>, <strong>–installation</strong> or <strong>–system</strong> options to change this.</p>
<p>
The list command can also be used to find installed apps that use a
certain runtime, with the <strong>–app-runtime</strong> option.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>List per-user installations.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>List the default system-wide installations.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>List a system-wide installation specified by NAME among those defined in
<em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–arch=ARCH</strong></p>
<blockquote>
<p>List apps/runtimes for this architecture. See <strong>flatpak
–supported-arches</strong> for architectures supported by the host.</p>
</blockquote>
<p>
<strong>-d</strong>, <strong>–show-details</strong></p>
<blockquote>
<p>Show origin, sizes and other extra information. Equivalent to
<strong>–columns=all</strong>.</p>
</blockquote>
<p>
<strong>–app</strong></p>
<blockquote>
<p>List applications.</p>
</blockquote>
<p>
<strong>–runtime</strong></p>
<blockquote>
<p>List runtimes.</p>
</blockquote>
<p>
<strong>–all</strong>, <strong>-a</strong></p>
<blockquote>
<p>List all installed runtimes, including locale and debug extensions.
These are hidden by default.</p>
</blockquote>
<p>
<strong>–app-runtime=RUNTIME</strong></p>
<blockquote>
<p>List applications that use the given runtime.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
<p>
<strong>–columns=FIELD,…</strong></p>
<blockquote>
<p>Specify what information to show about each ref. You can list multiple
fields, or use this option multiple times.</p>
<p>
Append :s[tart], :m[iddle], :e[nd] or :f[ull] to column names to change
ellipsization.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FIELDS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The following fields are understood by the <strong>–columns</strong> option:</p>
<p>
name</p>
<blockquote>
<p>Show the name</p>
</blockquote>
<p>
description</p>
<blockquote>
<p>Show the description</p>
</blockquote>
<p>
application</p>
<blockquote>
<p>Show the application or runtime ID</p>
</blockquote>
<p>
arch</p>
<blockquote>
<p>Show the architecture</p>
</blockquote>
<p>
branch</p>
<blockquote>
<p>Show the branch</p>
</blockquote>
<p>
runtime</p>
<blockquote>
<p>Show the used runtime</p>
</blockquote>
<p>
version</p>
<blockquote>
<p>Show the version</p>
</blockquote>
<p>
ref</p>
<blockquote>
<p>Show the ref</p>
</blockquote>
<p>
origin</p>
<blockquote>
<p>Show the origin remote</p>
</blockquote>
<p>
installation</p>
<blockquote>
<p>Show the installation</p>
</blockquote>
<p>
active</p>
<blockquote>
<p>Show the active commit</p>
</blockquote>
<p>
latest</p>
<blockquote>
<p>Show the latest commit</p>
</blockquote>
<p>
size</p>
<blockquote>
<p>Show the installed size</p>
</blockquote>
<p>
options</p>
<blockquote>
<p>Show options</p>
</blockquote>
<p>
all</p>
<blockquote>
<p>Show all columns</p>
</blockquote>
<p>
help</p>
<blockquote>
<p>Show the list of available columns</p>
</blockquote>
<p>
Note that field names can be abbreviated to a unique prefix.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
EXAMPLES
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><strong>$ flatpak –user –columns=app list</strong></p>
<blockquote>
<pre class="example">
Application
org.gnome.Builder
org.freedesktop.glxgears
org.gnome.MyApp
org.gnome.gedit
</pre>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*flatpak*(1), *flatpak-install*(1), *flatpak-update*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
